<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/768ca898-28b4-4e57-802e-47cfd7c1f15f/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.database_cluster.aws_rds_cluster.this[0] will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
        id                                  = "staging-push-database"
        tags                                = {}
      ~ vpc_security_group_ids              = [
          - "sg-04741ebca102662ab",
            # (1 unchanged element hidden)
        ]
        # (44 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service"
        name                               = "staging-push-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:188" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:188" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging-push" -> (known after apply)
      ~ revision                 = 188 -> (known after apply)
      - tags                     = {} -> null
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.tenant_database_cluster.aws_rds_cluster.this[0] will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
        id                                  = "staging-push-tenant-database"
        tags                                = {}
      ~ vpc_security_group_ids              = [
          - "sg-015df0c2c450c2046",
            # (1 unchanged element hidden)
        ]
        # (44 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.database_cluster.aws_rds_cluster.this[0] will be updated in-place%0A  ~ resource "aws_rds_cluster" "this" {%0A        id                                  = "staging-push-database"%0A        tags                                = {}%0A      ~ vpc_security_group_ids              = [%0A          - "sg-04741ebca102662ab",%0A            # (1 unchanged element hidden)%0A        ]%0A        # (44 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service"%0A        name                               = "staging-push-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:188" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:188" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging-push" -> (known after apply)%0A      ~ revision                 = 188 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (11 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.tenant_database_cluster.aws_rds_cluster.this[0] will be updated in-place%0A  ~ resource "aws_rds_cluster" "this" {%0A        id                                  = "staging-push-tenant-database"%0A        tags                                = {}%0A      ~ vpc_security_group_ids              = [%0A          - "sg-015df0c2c450c2046",%0A            # (1 unchanged element hidden)%0A        ]%0A        # (44 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0APlan: 1 to add, 3 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*